---
kind: type
id: T:Autodesk.Revit.DB.DeleteWorksetSettings
source: html/1952e14e-42d8-d672-0e72-d5fb1a83b73a.htm
---
# Autodesk.Revit.DB.DeleteWorksetSettings

This class represents the settings used to delete a workset.

## Syntax (C#)
```csharp
public class DeleteWorksetSettings : IDisposable
```